{
  "name": "stahla_kb_main_v2",
  "description": "Stahla Services Company Information. Contains details about services offered (including specific restroom trailers, porta potties, shower trailers, laundry trailers, ADA units, combo units, decontamination trailers, selfie trailers, and generators), company history, service areas, contact information, and frequently asked questions.",
  "text": "Stahla Services (Stahla Rentals) - Knowledge Base\nSummary\nStahla Services, now known simply as Stahla, is a Nebraska-based, family-owned company specializing in luxury portable restroom and shower trailer rentals. Founded in 2014 by Grant and Erin Stahla, the company emphasizes hospitality, cleanliness, and a faith-driven commitment to customer care. Serving 17 states across the Midwest and Southwest, Stahla provides high-end sanitation solutions for events, construction sites, and emergency responses. Their trailers feature amenities like climate control, flushing toilets, and running water, aiming to offer a dignified and comfortable experience. With a focus on exceptional service and community values, Stahla has grown into a trusted provider in the portable sanitation industry.\nCompany Overview\nLegal Name: Stahla Services, LLC\nFounded: 2014\nFounders: Grant Stahla (CEO) & Erin Stahla (Co-Owner)\nCore Values: Family-run, faith-driven, customer-first service, Midwest work ethic\nServices Offered\nRestroom Trailer Rentals: Options range from 2-stall to 10-stall configurations. Examples: '2 Stall Restroom Trailer (Luxury)', '4 Stall Restroom Trailer (Standard)', '8 Stall Restroom Trailer (ADA Combo)'.\nADA Restroom Trailers: Fully compliant with Americans with Disabilities Act (ADA) standards. Include ramps, handrails, and spacious interiors.\nShower Trailer Rentals: Provide private, lockable shower stalls with hot water. Examples: '3 Stall Shower Trailer', '8 Stall Shower/Restroom Combo Trailer'.\nLaundry Trailer Rentals: Mobile units equipped with commercial-grade washers and dryers.\nPorta Potty Rentals: Standard, budget-friendly option. Available in basic, deluxe, or handwashing-equipped models. Includes ADA Porta Potty options.\nGenerator Rentals: Various sizes available, e.g., '3kW Generator', '7kW Generator'.\nOther Services: Holding tanks, fresh water delivery, regular servicing/pump-outs, cleaning.\nService Area\nServes 17 U.S. states: Arkansas (AR), Colorado (CO), Illinois (IL), Iowa (IA), Kansas (KS), Louisiana (LA), Minnesota (MN), Missouri (MO), Montana (MT), Nebraska (NE), New Mexico (NM), North Dakota (ND), Oklahoma (OK), South Dakota (SD), Texas (TX), Wisconsin (WI), Wyoming (WY)\nHeadquarters and Locations\nPrimary HQ: Omaha, Nebraska\nMain Address: 16902 South 180th Street, Suite 200, Springfield, NE 68059\nOther Office Locations:\nLincoln, NE – 420 W A St, Suite 200\nGretna, NE – 21824 Williams Circle\nSmithville, MO – 17609 HH Lake Road\nDenver, CO – 1340 Umatilla St\nContact Information\nPhone: (844) 900-3190\nEmail: [email protected]\nBusiness Hours:\nMon–Fri: 8 AM–5 PM\nSat: 8 AM–5 PM\nSun: Closed\nWebsite: https://stahla.com/\nProduct List (Examples - refer to full product sheet for all models):\n2 Stall Restroom Trailer (Luxury), 2 Stall Restroom Trailer (Standard), 3 Stall Restroom Trailer (Luxury), 4 Stall Restroom Trailer (Standard), 4 Stall Restroom Trailer (ADA Compliant), 5 Stall Restroom Trailer, 6 Stall Restroom Trailer, 8 Stall Restroom Trailer, 10 Stall Restroom Trailer, ADA Porta Potty, Standard Porta Potty, Deluxe Porta Potty, Handwash Station (Porta Potty Addon), 3 Stall Shower Trailer, 8 Stall Shower Trailer, Laundry Trailer (8 Washer/Dryer), 3kW Generator, 7kW Generator.\nUsage Types for Quotes: event, commercial, construction, disaster_relief, other."
}